УНФ_ТЕСТ/src/Documents/ПриемИПередачаВРемонт/ПриемИПередачаВРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемИПередачаВРемонт</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПереданныеВРемонте</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыОтложенные</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРемонте</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершенияРемонта</name>
    <type>
      <types>EnumRef.ВариантыЗавершенияРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРемонта</name>
    <type>
      <types>EnumRef.ВариантыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаИзРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Гарантийный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантияНаРемонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачаИзРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачаВСервисныйЦентр</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРемонтВыполнен</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ОприходованиеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРаботы</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМеханическихПовреждений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРемонта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаВСервисныйЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКладовщика</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РемонтВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисЦентр</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеРемонта</name>
    <type>
      <types>CatalogRef.ЭтапыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияГарантии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка налога на добавленную стоимость</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РемонтОплаченПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияГарантии</name>
    <type>
      <types>CatalogRef.ДополнительныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПриемки</name>
    <type>
      <types>CatalogRef.ДополнительныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предоплата</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Enums/ВариантыРемонта/ВариантыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРемонта</name>
  <enumValues>
    <name>СервисЦентр</name>
  </enumValues>
  <enumValues>
    <name>НашаМастерскаяПростойРемонт</name>
  </enumValues>
  <enumValues>
    <name>НашаМастерскаяМногоэтапныйРемонт</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/ПриемИПередачаВРемонт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Серийные номера
	Если РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки() = Истина 
		И Номенклатура.ИспользоватьСерийныеНомера Тогда
		
		ПроверяемыеРеквизиты.Добавить("СерийныйНомер");
		
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		Если РемонтВыполнен Тогда
			
			ПроверяемыеРеквизиты.Добавить("НаправлениеДеятельности");
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
	
		ПроверяемыеРеквизиты.Добавить("СервисЦентр");
	
	КонецЕсли;
	
	
	Если ВыдачаИзРемонта И (НЕ РемонтВыполнен) Тогда
		Если ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
		    ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не установлен ""Принят из сервисного центра""!'"));
		Иначе	
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не установлен ""Ремонт выполнен""!'"));
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	Если РемонтВыполнен И ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр И (НЕ ПередачаВСервисныйЦентр) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не установлен ""Передан в сервисный центр""!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И РемонтВыполнен И ДатаПередачаВСервисныйЦентр > ДатаРемонтВыполнен Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата передачи в сервисный центр не может быть больше даты приема из сервисного центра!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если РемонтВыполнен И ВыдачаИзРемонта И ДатаРемонтВыполнен > ДатаВыдачаИзРемонта Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата выпонения ремонта не может быть больше даты выдачи из ремонта!'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ПередачаВСервисныйЦентр И Дата > ДатаПередачаВСервисныйЦентр Тогда
		Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
			// Если пользователь установил ДатаПередачаВСервисныйЦентр в новом документе до записи, она будет меньше даты и
			// времени записи документа
			Дата = ДатаПередачаВСервисныйЦентр;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Дата передачи в сервисный центр не может быть меньше даты приема в ремонт (даты документа)!'"));
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) И Номенклатура.ПроверятьЗаполнениеХарактеристики И Не ЗначениеЗаполнено(Характеристика)
		Тогда  		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для данной номенклатуры, заполнение поля характеристики является обезательным!'"));
		Отказ = Истина;		
	КонецЕсли;
	
	РасчетыРаботаСФормамиВызовСервера.ПроверитьЗаполнениеДокументаПредоплаты(Контрагент, ПроверяемыеРеквизиты);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ПриемИПередачаВРемонт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	
	УправлениеНебольшойФирмойСервер.ОтразитьТоварыВРемонте(ДополнительныеСвойства, Движения, Отказ);
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
	Если (ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.НашаМастерскаяПростойРемонт
		ИЛИ ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр) Тогда
		
		Если ДополнительныеСвойства.РемонтВыполнен Тогда
			
			УправлениеНебольшойФирмойСервер.ОтразитьТоварыВРемонте(ДополнительныеСвойства, Движения, Отказ);
			// СерийныеНомера
			УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
			УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
			
			УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли;
	
		УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ВариантРемонта = Перечисления.ВариантыРемонта.СервисЦентр Тогда
		
		УправлениеНебольшойФирмойСервер.ОтразитьТоварыПереданныеВРемонте(ДополнительныеСвойства, Движения, Отказ);
		
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПриемИПередачаВРемонт.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.ПриемИПередачаВРемонт.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	УправлениеНебольшойФирмойСервер.ПриЗаписиДокументаОснованияСчетаФактуры(Ссылка, ДополнительныеСвойства, Ложь);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ДополнительныеСвойства.Вставить("ВариантРемонта", ВариантРемонта);
		ДополнительныеСвойства.Вставить("ПередачаВСервисныйЦентр", ПередачаВСервисныйЦентр);
		ДополнительныеСвойства.Вставить("ДатаПередачаВСервисныйЦентр", ДатаПередачаВСервисныйЦентр);
		ДополнительныеСвойства.Вставить("РемонтВыполнен", РемонтВыполнен);
		ДополнительныеСвойства.Вставить("ДатаРемонтВыполнен", ДатаРемонтВыполнен);
		ДополнительныеСвойства.Вставить("ВыдачаИзРемонта", ВыдачаИзРемонта);
		ДополнительныеСвойства.Вставить("ДатаВыдачаИзРемонта", ДатаВыдачаИзРемонта);
		ДополнительныеСвойства.Вставить("СуммаДокумента", СуммаДокумента);
	КонецЕсли;
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
		ИдентификаторПлатежа = РасчетыСлужебный.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПередачаВСервисныйЦентр	= Ложь;
	РемонтВыполнен			= Ложь;
	ВыдачаИзРемонта			= Ложь;
	ДатаПередачаВСервисныйЦентр	= Дата("00010101");
	ДатаРемонтВыполнен			= Дата("00010101");
	ДатаВыдачаИзРемонта			= Дата("00010101");
	
	Предоплата.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
